using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace AdditionalTaskB2
{
    /// <summary>
    /// 1. Создать метод, принимающий по ссылке/адресу два аргумента типа double, имеющий один выходной аргумент типа bool и 
    /// возвращающий значение типа double. 
    /// Метод имеет следующую логику работы:
    ///   - если первый double-аргумент больше второго - выходной аргумент возвращает true, 
    ///     метод возвращает результат умножения double-армунетов
    ///   - если второй double-аргумент больше первого - выходной аргумент возвращает false,
    ///     метод возвращает результат деления double-аругментов
    ///   - если первый и второй double-аргументы равны - выходной аргумент возвращает true, 
    ///     метод возвращает результат возведения в квадрат первого аргумента (используйте класс Math, метод Pow)
    /// 2. Обеспечить вызов метода таким образом, чтобы выполнились все три перечисленных условия.
    /// Результаты вызовов данного метода необходимо отобразить на Console
    /// </summary>
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
