using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Lesson04_02
{
    /// <summary>
    /// 1. Разработать метод, возвращающий целое значение
    /// 2. В методе созлать массив целых чисел и проинициализировать его элементы
    /// 3. С помощью класса Random, получить число в диапазоне [-20; 20] и сохранить
    /// его в переменную Index, используемую в качестве индекса элементов массива 3
    /// 4. Составить в методе такой сценарий обработки исключений, чтобы он
    /// гарантированно возвращал знаение элемента массива, полученного по
    /// сгенерированному случайным образом индексу
    /// </summary>
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
