using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace AdditionalTaskH1
{
    /// <summary>
    /// 1. Создать класс с автосвойством типа StringBuilder, который создается при вызове конструктора по-умолчанию.
    /// 2. Создать два объекта данного класса - один при использовании слабой ссылки, второй - стандартным способом.
    /// 3. Заполнение свойств объектов 500 случайными строками, минимум, по 50 символов каждая.
    /// 4. Определение поколения для каждого из созданных объектов.
    /// 5. Провести принудительную сборку мусора для поколения 0.
    /// 6. Проверить существование объектов, созданных различными способами.
    /// 7. Отобразить поколения данных объектов.
    /// 
    /// </summary>
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
